"Scan for Large and Old Files" = "Scan for Large and Old Files";
"Erase with CleanMyMac" = "Erase with CleanMyMac";
"Securely Erase with CleanMyMac" = "Securely Erase with CleanMyMac";
"Clean with CleanMyMac" = "Clean with CleanMyMac";
"Uninstall with CleanMyMac" = "Uninstall with CleanMyMac";
"Clean iPhoto Library with CleanMyMac" = "Clean iPhoto Library with CleanMyMac";